AcDbParentTransformOfChildPE.getParentTransformOfChild(AcDbObject!System.Runtime.CompilerServices.IsConst*,AcDbObjectId!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcGeMatrix3d*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Returns the transform of the child object in the parent object.

AcDbParentTransformOfChildPE
Protocol extension used by AcDbCompoundObjectId::getTransform() to find the
transform that the parent object applies to its child object, if the AcDbCompoundObjectId
contains a whole path of objects. For example for AcDbBlockReference the returned
transform is AcDbBlockReference::blockTransform(). If the path contains other parent
objects than AcDbBlockReference (it seems to be allowed, e.g. the parent object may
be a custom entity), the parent object may specify the transform. If the parent object
does not expose this PE, an identify transform is assumed.